FROM node
# 어떤 환경을 할지 선택한다

WORKDIR /app
# RUN 명령어를 실행하는 위치는 기본 root 위치이기 때문에 이미지화한 항목들이 있는 작업 디렉토리를 설정해서
# 해당 디렉토리에서 명령어를 실행할 수 있도록 해준다

COPY package.json /app
# 소스코드를 복사하는 코드보다 위쪽으로 위치해서 package는 변하지 않았는데 소스코드만 변경되었을 때
# 불필요한 npm install이 동작하지 않도록 한다 - 변하지 않은 레이어는 캐시가 작동하는 원리

RUN npm install

COPY . /app
# 첫 번째 인자는 어느 파일들을 이미지화 할 건지 . -> Dockerfile이 있는 폴더의 하위 모든 항목들 선택
# 두 번째 인자는 이미지의 파일 시스템 어디에 해당 항목들을 둘 건지
# WORKDIR을 설정했기 때문에 ./을 실행하면 해당 명령어가 실행되고 있는 /app 폴더를 선택하게 된다
# 절대경로로 표시하는게 더 직관적이기 때문에 이 예제에서는 절대경로로 표시한다

EXPOSE 80
# 컨테이너가 어떤 port로 실행중인 걸 docker에 알리는 코드

CMD ["node", "server.js"]
# CMD를 사용하면 이미지를 기반으로 컨테이너를 생성한 후에 명령어를 실행한다
# 명령어를 나눠서 각각의 문자열로 입력한다